mediaMicroservices/wrk2/outs/c300_r1000.out
Running 1m test @ http://10.100.189.154:8080/wrk2-api/review/compose
  4 threads and 300 connections
  Thread calibration: mean lat.: 9999.974ms, rate sampling interval: 20021ms
  Thread calibration: mean lat.: 10000.156ms, rate sampling interval: 20021ms
  Thread calibration: mean lat.: 9998.336ms, rate sampling interval: 20004ms
  Thread calibration: mean lat.: 10006.528ms, rate sampling interval: 20021ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    33.08s     7.67s    0.90m    72.86%
    Req/Sec    50.00     43.09    98.00     87.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   31.62s 
 75.000%   39.39s 
 90.000%   42.66s 
 99.000%    0.90m 
 99.900%    0.93m 
 99.990%    0.94m 
 99.999%    0.94m 
100.000%    0.94m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10002.431     0.000000          208         1.00
   27623.423     0.100000          838         1.11
   29458.431     0.200000         1670         1.25
   30195.711     0.300000         2523         1.43
   30867.455     0.400000         3350         1.67
   31621.119     0.500000         4180         2.00
   32047.103     0.550000         4590         2.22
   32669.695     0.600000         5014         2.50
   33538.047     0.650000         5429         2.86
   35192.831     0.700000         5841         3.33
   39387.135     0.750000         6259         4.00
   40140.799     0.775000         6471         4.44
   40632.319     0.800000         6677         5.00
   41123.839     0.825000         6892         5.71
   41615.359     0.850000         7093         6.67
   42139.647     0.875000         7310         8.00
   42434.559     0.887500         7419         8.89
   42663.935     0.900000         7514        10.00
   42991.615     0.912500         7619        11.43
   43286.527     0.925000         7720        13.33
   43679.743     0.937500         7825        16.00
   43909.119     0.943750         7875        17.78
   44171.263     0.950000         7927        20.00
   44564.479     0.956250         7977        22.86
   44957.695     0.962500         8029        26.67
   45514.751     0.968750         8081        32.00
   45776.895     0.971875         8109        35.56
   46202.879     0.975000         8134        40.00
   47513.599     0.978125         8159        45.71
   51740.671     0.981250         8185        53.33
   52592.639     0.984375         8211        64.00
   52985.855     0.985938         8224        71.11
   53215.231     0.987500         8238        80.00
   53542.911     0.989062         8250        91.43
   53870.591     0.990625         8266       106.67
   54034.431     0.992188         8276       128.00
   54231.039     0.992969         8285       142.22
   54362.111     0.993750         8289       160.00
   54657.023     0.994531         8296       182.86
   54919.167     0.995313         8302       213.33
   55115.775     0.996094         8309       256.00
   55246.847     0.996484         8315       284.44
   55246.847     0.996875         8315       320.00
   55476.223     0.997266         8320       365.71
   55574.527     0.997656         8323       426.67
   55672.831     0.998047         8325       512.00
   55705.599     0.998242         8327       568.89
   55738.367     0.998437         8329       640.00
   55803.903     0.998633         8330       731.43
   55967.743     0.998828         8333       853.33
   55967.743     0.999023         8333      1024.00
   56066.047     0.999121         8334      1137.78
   56098.815     0.999219         8337      1280.00
   56098.815     0.999316         8337      1462.86
   56098.815     0.999414         8337      1706.67
   56098.815     0.999512         8337      2048.00
   56197.119     0.999561         8338      2275.56
   56197.119     0.999609         8338      2560.00
   56360.959     0.999658         8339      2925.71
   56360.959     0.999707         8339      3413.33
   56360.959     0.999756         8339      4096.00
   56524.799     0.999780         8340      4551.11
   56524.799     0.999805         8340      5120.00
   56524.799     0.999829         8340      5851.43
   56524.799     0.999854         8340      6826.67
   56524.799     0.999878         8340      8192.00
   56623.103     0.999890         8341      9102.22
   56623.103     1.000000         8341          inf
#[Mean    =    33076.655, StdDeviation   =     7668.341]
#[Max     =    56590.336, Total count    =         8341]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  8364 requests in 1.00m, 1.83MB read
  Socket errors: connect 0, read 0, write 0, timeout 11
  Non-2xx or 3xx responses: 2202
Requests/sec:    138.98
Transfer/sec:     31.15KB