mediaMicroservices/wrk2/outs/c300_r2000.out
Running 1m test @ http://10.100.189.154:8080/wrk2-api/review/compose
  4 threads and 300 connections
  Thread calibration: mean lat.: 10004.889ms, rate sampling interval: 20037ms
  Thread calibration: mean lat.: 10002.705ms, rate sampling interval: 20021ms
  Thread calibration: mean lat.: 10002.432ms, rate sampling interval: 20021ms
  Thread calibration: mean lat.: 10004.187ms, rate sampling interval: 20021ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    30.66s    13.90s   50.66s    61.94%
    Req/Sec     6.75      0.43     7.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   30.06s 
 75.000%   40.27s 
 90.000%   50.04s 
 99.000%   50.66s 
 99.900%    0.85m 
 99.990%    0.86m 
 99.999%    0.86m 
100.000%    0.86m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10002.431     0.000000          115         1.00
   10010.623     0.100000          192         1.11
   19824.639     0.200000          292         1.25
   20054.015     0.300000          438         1.43
   29671.423     0.400000          582         1.67
   30064.639     0.500000          728         2.00
   30261.247     0.550000          803         2.22
   39485.439     0.600000          874         2.50
   39878.655     0.650000          951         2.86
   40042.495     0.700000         1020         3.33
   40271.871     0.750000         1094         4.00
   40468.479     0.775000         1128         4.44
   49315.839     0.800000         1165         5.00
   49577.983     0.825000         1200         5.71
   49807.359     0.850000         1239         6.67
   49905.663     0.875000         1275         8.00
   49971.199     0.887500         1296         8.89
   50036.735     0.900000         1317        10.00
   50102.271     0.912500         1331        11.43
   50167.807     0.925000         1353        13.33
   50233.343     0.937500         1368        16.00
   50266.111     0.943750         1376        17.78
   50298.879     0.950000         1384        20.00
   50331.647     0.956250         1394        22.86
   50364.415     0.962500         1403        26.67
   50429.951     0.968750         1412        32.00
   50462.719     0.971875         1417        35.56
   50462.719     0.975000         1417        40.00
   50495.487     0.978125         1423        45.71
   50528.255     0.981250         1427        53.33
   50561.023     0.984375         1432        64.00
   50593.791     0.985938         1433        71.11
   50626.559     0.987500         1436        80.00
   50659.327     0.989062         1439        91.43
   50692.095     0.990625         1441       106.67
   50724.863     0.992188         1442       128.00
   50757.631     0.992969         1443       142.22
   50790.399     0.993750         1446       160.00
   50790.399     0.994531         1446       182.86
   50855.935     0.995313         1447       213.33
   50888.703     0.996094         1448       256.00
   50888.703     0.996484         1448       284.44
   50987.007     0.996875         1449       320.00
   51052.543     0.997266         1450       365.71
   51052.543     0.997656         1450       426.67
   51118.079     0.998047         1452       512.00
   51118.079     0.998242         1452       568.89
   51118.079     0.998437         1452       640.00
   51118.079     0.998633         1452       731.43
   51118.079     0.998828         1452       853.33
   51118.079     0.999023         1452      1024.00
   51118.079     0.999121         1452      1137.78
   51118.079     0.999219         1452      1280.00
   51314.687     0.999316         1453      1462.86
   51314.687     1.000000         1453          inf
#[Mean    =    30658.904, StdDeviation   =    13896.413]
#[Max     =    51281.920, Total count    =         1453]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1500 requests in 1.00m, 522.95KB read
  Non-2xx or 3xx responses: 1500
Requests/sec:     24.96
Transfer/sec:      8.70KB