mediaMicroservices/wrk2/outs/c300_r250.out
Running 1m test @ http://10.100.189.154:8080/wrk2-api/review/compose
  4 threads and 300 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9998.336ms, rate sampling interval: 20004ms
  Thread calibration: mean lat.: 10002.432ms, rate sampling interval: 20021ms
  Thread calibration: mean lat.: 9998.336ms, rate sampling interval: 20004ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    29.64s    14.07s    0.91m    59.52%
    Req/Sec     7.66     29.60   111.00     93.25%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   29.80s 
 75.000%   41.06s 
 90.000%   49.55s 
 99.000%    0.91m 
 99.900%    0.94m 
 99.990%    0.95m 
 99.999%    0.95m 
100.000%    0.95m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10002.431     0.000000          230         1.00
   10002.431     0.100000          230         1.11
   10010.623     0.200000          292         1.25
   20004.863     0.300000          439         1.43
   23314.431     0.400000          582         1.67
   29802.495     0.500000          728         2.00
   31113.215     0.550000          801         2.22
   33652.735     0.600000          873         2.50
   37388.287     0.650000          947         2.86
   39682.047     0.700000         1019         3.33
   41058.303     0.750000         1092         4.00
   42336.255     0.775000         1128         4.44
   43941.887     0.800000         1164         5.00
   45580.287     0.825000         1201         5.71
   46923.775     0.850000         1237         6.67
   48562.175     0.875000         1274         8.00
   49020.927     0.887500         1294         8.89
   49545.215     0.900000         1311        10.00
   50069.503     0.912500         1328        11.43
   50528.255     0.925000         1347        13.33
   50954.239     0.937500         1365        16.00
   51249.151     0.943750         1374        17.78
   51642.367     0.950000         1384        20.00
   52133.887     0.956250         1392        22.86
   52461.567     0.962500         1401        26.67
   52690.943     0.968750         1410        32.00
   52887.551     0.971875         1415        35.56
   53084.159     0.975000         1419        40.00
   53379.071     0.978125         1424        45.71
   53706.751     0.981250         1428        53.33
   54034.431     0.984375         1433        64.00
   54099.967     0.985938         1436        71.11
   54165.503     0.987500         1437        80.00
   54460.415     0.989062         1441        91.43
   54493.183     0.990625         1442       106.67
   55246.847     0.992188         1444       128.00
   55279.615     0.992969         1445       142.22
   55312.383     0.993750         1446       160.00
   55508.991     0.994531         1448       182.86
   55541.759     0.995313         1449       213.33
   55574.527     0.996094         1450       256.00
   55574.527     0.996484         1450       284.44
   55672.831     0.996875         1451       320.00
   56033.279     0.997266         1452       365.71
   56033.279     0.997656         1452       426.67
   56197.119     0.998047         1453       512.00
   56197.119     0.998242         1453       568.89
   56197.119     0.998437         1453       640.00
   56426.495     0.998633         1454       731.43
   56426.495     0.998828         1454       853.33
   56426.495     0.999023         1454      1024.00
   56426.495     0.999121         1454      1137.78
   56426.495     0.999219         1454      1280.00
   57114.623     0.999316         1455      1462.86
   57114.623     1.000000         1455          inf
#[Mean    =    29639.785, StdDeviation   =    14069.422]
#[Max     =    57081.856, Total count    =         1455]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1464 requests in 1.00m, 510.40KB read
  Socket errors: connect 0, read 0, write 0, timeout 1711
  Non-2xx or 3xx responses: 1464
Requests/sec:     24.36
Transfer/sec:      8.49KB